<a href="https://colab.research.google.com/github/mandresblanco/Comercio_Colombia/blob/main/Comercio_Colombia.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Los Datos:
En los datos encontrarás información de las exportaciones e importaciones de Colombia de 1962 a 2017. Fueron extraídos del [OEC: The Observatory of Economic Complexity.
](https://legacy.oec.world/en/)

El objetivo es hacer un análisis exploratorio para encontrar insights valiosos a partir de esos datos.

Preguntas:

1. ¿Cuál es el top 10 países a los que Colombia exporta sus productos y su evolución con respecto al tiempo?
2. ¿Cuál es el top 10 países de los que Colombia importa sus productos y su evolución con respecto al tiempo?
3. ¿Existe algún producto que debido a cambios económicos en la oferta/demanda halla causado un decremento en el volumen de dinero que se mueve con él?
4. ¿Cuáles sectores económicos tienen mayor importancia en las exportaciones de Colombia y por qué?

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
from google.colab import drive 
drive.mount('/content/drive')

Drive already mounted at /content/drive; to attempt to forcibly remount, call drive.mount("/content/drive", force_remount=True).

In [ ]:
%cd '/content/drive/My Drive/Colab Notebooks/Projects/Triathlon'
!ls

/content/drive/My Drive/Colab Notebooks/Projects/Triathlon
Triathlondf_colombia_exports.csv  Triathlondf_groups_sitc.csv
Triathlondf_colombia_imports.csv  Triathlondf_products_sitc.csv
Triathlondf_country_names.csv

In [ ]:
df_colombia_exports = pd.read_csv('https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/colombia_exports.csv', sep='|')
df_colombia_exports

        Unnamed: 0  year origin dest  sitc4  export_val  import_val
0           761444  1962    col  civ    712         0.0     13000.0
1           761445  1962    col  civ   1210     12000.0         0.0
2           761446  1962    col  cod   2925         0.0      2000.0
3           761447  1962    col  cog   2925         0.0      2000.0
4           761448  1962    col  dza   1210    112000.0         0.0
...            ...   ...    ...  ...    ...         ...         ...
799401   124876488  2017    col  ury   6658         NaN      8658.0
799402   124876489  2017    col  ury   8924      4285.5         NaN
799403   124876490  2017    col  ury   8928     25667.5      3816.5
799404   124876491  2017    col  ury   8972      5306.0       500.0
799405   124876492  2017    col  ury   9310  10063053.0   5500539.5

[799406 rows x 7 columns]

Primera tabla, continene informacion sobre las [exportaciones de colombia desde 1962 hasta 2017.](https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/colombia_exports.csv)

In [ ]:
df_colombia_imports= pd.read_csv('https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/colombia_imports.csv', sep="|")
df_colombia_imports

        Unnamed: 0  year origin dest  sitc4  export_val  import_val
0            11564  1962    civ  col    712     13000.0         0.0
1            11565  1962    civ  col   1210         0.0     12000.0
2            17741  1962    cod  col   2925      2000.0         0.0
3            20216  1962    cog  col   2925      2000.0         0.0
4            25005  1962    dza  col   1210         0.0    112000.0
...            ...   ...    ...  ...    ...         ...         ...
775897   124923798  2017    ury  col   6658      8658.0         NaN
775898   124923799  2017    ury  col   8924         NaN      4285.5
775899   124923800  2017    ury  col   8928      3816.5     25667.5
775900   124923801  2017    ury  col   8972       500.0      5306.0
775901   124923802  2017    ury  col   9310   5500539.5  10063053.0

[775902 rows x 7 columns]

Segunda tabla, continene informacion sobre las [importaciones de colombia desde 1962 hasta 2017.](https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/colombia_imports.csv)

In [ ]:
df_country_names = pd.read_csv('https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/country_names.csv', sep="|", skipfooter=2)
df_country_names

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

     Unnamed: 0     id id_3char          name
0             0  afago      ago        Angola
1             1  afbdi      bdi       Burundi
2             2  afben      ben         Benin
3             3  afbfa      bfa  Burkina Faso
4             4  afbwa      bwa      Botswana
..          ...    ...      ...           ...
256         256  saper      per          Peru
257         257  sapry      pry      Paraguay
258         258  sasur      sur      Suriname
259         259  saury      ury       Uruguay
260         260  saven      ven     Venezuela

[261 rows x 4 columns]

Tercera tabla, contiene informacion de los paises [ y sus diminutivos.](https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/country_names.csv)

In [ ]:
df_groups_sitc = pd.read_csv('https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/groups_sitc_rev2.csv', sep="|")
df_groups_sitc

    Unnamed: 0  id                                           category
0            1   0     Live animals other than animals of division 03
1            2   1                         Meat and meat preparations
2            3   2                     Dairy products and birds' eggs
3            4   3  Fish, crustaceans, molluscs and preparations t...
4            5   4                    Cereals and cereal preparations
..         ...  ..                                                ...
60          61  87    Professional and scientific instruments, n.e.s.
61          62  88  Photo apparatus, optical goods, watches and cl...
62          63  89        Miscellaneous manufactured articles, n.e.s.
63          64  96  Coin (other than gold coin), not being legal t...
64          65  97  Gold, non-monetary (excluding gold ores and co...

[65 rows x 3 columns]

Cuarta tabla, contiene informacion relacionada con las [categorias de la transaccion comercial.
](https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/groups_sitc_rev2.csv)

In [ ]:
df_products_sitc = pd.read_csv('https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/products_sitc_rev2.csv', sep="|")
df_products_sitc

     Unnamed: 0  ...                                               name
0             0  ...                                 Initiating Devices
1             1  ...                      Polymerization Ion Exchangers
2             2  ...  Rubber tires, tire cases, inner and flaps, for...
3             3  ...                                          Car Tires
4             4  ...                           Other articles of rubber
..          ...  ...                                                ...
983         983  ...                          Unclassified Transactions
984         984  ...                         Miscellaneous Live Animals
985         985  ...                                      Non-Gold Coin
986         986  ...                      Live animals chiefly for food
987         987  ...                                               Meat

[988 rows x 4 columns]

Quinta tabla, contiene informacion [relacionada con titc](https://raw.githubusercontent.com/fawkes55/datasets_to_olimpiadas/master/products_sitc_rev2.csv) (Standard International Trade Classification)

1. Se relaciona la primera tabla con la segunda en la columna sitc4.
2. Se relaciona la primera tabla con la tercera con el diminutivo de los paises.
3. Se relaciona la primera tabla con la quinta por el sitc.

In [ ]:
direct1 = '/content/drive/My Drive/Colab Notebooks/Projects/Triathlon{}'
df_colombia_exports.to_csv(direct1.format('df_colombia_exports.csv'))

direct2 = '/content/drive/My Drive/Colab Notebooks/Projects/Triathlon{}'
df_colombia_imports.to_csv(direct2.format('df_colombia_imports.csv'))

direct3 = '/content/drive/My Drive/Colab Notebooks/Projects/Triathlon{}'
df_country_names.to_csv(direct3.format('df_country_names.csv'))

direct4 = '/content/drive/My Drive/Colab Notebooks/Projects/Triathlon{}'
df_groups_sitc.to_csv(direct4.format('df_groups_sitc.csv'))

direct5 = '/content/drive/My Drive/Colab Notebooks/Projects/Triathlon{}'
df_products_sitc.to_csv(direct5.format('df_products_sitc.csv'))

Por preferencia personal prefiero ver los datasets desde excel, por eso los he exportado.

In [ ]:
# df_colombia_exports.shape
df_colombia_exports = df_colombia_exports.fillna(0)
df_colombia_exports.isnull().sum(axis = 0)

Unnamed: 0    0
year          0
origin        0
dest          0
sitc4         0
export_val    0
import_val    0
dtype: int64

In [ ]:
# df_colombia_imports.shape
df_colombia_imports = df_colombia_imports.fillna(0)

df_colombia_imports.isnull().sum(axis = 0)

Unnamed: 0    0
year          0
origin        0
dest          0
sitc4         0
export_val    0
import_val    0
dtype: int64

Limpieza de valores null

In [ ]:
# print(df_colombia_imports.head(), '\n', df_colombia_exports.head())
df_col_exp =  pd.merge(df_colombia_exports[['year', 'origin', 'dest',  'sitc4',  'export_val',  'import_val']],
                    df_products_sitc[['name','sitc']], left_on = ['sitc4'], right_on='sitc', how = 'inner')

df_col_exp =  pd.merge(df_col_exp[['year', 'origin', 'dest',  'export_val',  'import_val']],
                    df_country_names[['id_3char','name']], left_on = ['dest'], right_on='id_3char', how = 'inner')
df_col_exp = df_col_exp.drop(columns='id_3char')
df_col_exp

        year origin dest  export_val  import_val                      name
0       1962    col  civ         0.0     13000.0             Cote d'Ivoire
1       2006    col  civ     23572.0         0.0             Cote d'Ivoire
2       1962    col  civ     12000.0         0.0             Cote d'Ivoire
3       1971    col  civ      9000.0         0.0             Cote d'Ivoire
4       1972    col  civ      7000.0         0.0             Cote d'Ivoire
...      ...    ...  ...         ...         ...                       ...
782626  2009    col  mnp         0.0      3588.0  Northern Mariana Islands
782627  2010    col  mnp         0.0       627.0  Northern Mariana Islands
782628  2012    col  mnp         0.0       197.0  Northern Mariana Islands
782629  2004    col  mnp      2170.0         0.0  Northern Mariana Islands
782630  1999    col  mnp     42804.0         0.0  Northern Mariana Islands

[782631 rows x 6 columns]

Tabla de los datos reelevantes